In [2]:
import numpy as np
import pandas as pd

In [3]:
dates=pd.date_range('20180531', periods=6)
dates

DatetimeIndex(['2018-05-31', '2018-06-01', '2018-06-02', '2018-06-03',
               '2018-06-04', '2018-06-05'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-05-31 -1.635571  1.584917 -0.176443 -2.405092
2018-06-01  0.280497  0.035116  1.539878  0.887744
2018-06-02  0.133557  0.566037 -0.255709  1.003797
2018-06-03 -2.278084 -0.800635  0.811075 -0.527858
2018-06-04  0.700106 -0.818080 -0.554525 -0.931795
2018-06-05  1.251413  0.050459 -1.382395  0.126959

In [5]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.date_range('20130102',periods=4),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-03  1.0  3  train  foo
2  1.0 2013-01-04  1.0  3   test  foo
3  1.0 2013-01-05  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.head

<bound method DataFrame.head of                    A         B         C         D
2018-05-31 -1.635571  1.584917 -0.176443 -2.405092
2018-06-01  0.280497  0.035116  1.539878  0.887744
2018-06-02  0.133557  0.566037 -0.255709  1.003797
2018-06-03 -2.278084 -0.800635  0.811075 -0.527858
2018-06-04  0.700106 -0.818080 -0.554525 -0.931795
2018-06-05  1.251413  0.050459 -1.382395  0.126959>

In [8]:
df.tail(1)

                   A         B         C         D
2018-06-05  1.251413  0.050459 -1.382395  0.126959

In [9]:
df.index

DatetimeIndex(['2018-05-31', '2018-06-01', '2018-06-02', '2018-06-03',
               '2018-06-04', '2018-06-05'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [11]:
df.T

   2018-05-31  2018-06-01  2018-06-02  2018-06-03  2018-06-04  2018-06-05
A   -1.635571    0.280497    0.133557   -2.278084    0.700106    1.251413
B    1.584917    0.035116    0.566037   -0.800635   -0.818080    0.050459
C   -0.176443    1.539878   -0.255709    0.811075   -0.554525   -1.382395
D   -2.405092    0.887744    1.003797   -0.527858   -0.931795    0.126959

In [12]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-05-31 -2.405092 -0.176443  1.584917 -1.635571
2018-06-01  0.887744  1.539878  0.035116  0.280497
2018-06-02  1.003797 -0.255709  0.566037  0.133557
2018-06-03 -0.527858  0.811075 -0.800635 -2.278084
2018-06-04 -0.931795 -0.554525 -0.818080  0.700106
2018-06-05  0.126959 -1.382395  0.050459  1.251413

In [13]:
df['A']

2018-05-31   -1.635571
2018-06-01    0.280497
2018-06-02    0.133557
2018-06-03   -2.278084
2018-06-04    0.700106
2018-06-05    1.251413
Freq: D, Name: A, dtype: float64

In [14]:
df[0:3]

                   A         B         C         D
2018-05-31 -1.635571  1.584917 -0.176443 -2.405092
2018-06-01  0.280497  0.035116  1.539878  0.887744
2018-06-02  0.133557  0.566037 -0.255709  1.003797

In [15]:
df.loc[dates[1]]

A    0.280497
B    0.035116
C    1.539878
D    0.887744
Name: 2018-06-01 00:00:00, dtype: float64

In [16]:
#df.loc[dates[0],['A','B']]
df.loc['20180601',['A','B']]

A    0.280497
B    0.035116
Name: 2018-06-01 00:00:00, dtype: float64

In [17]:
#df.iloc[[1,2,4],[0,2]]
#df.iloc[:,[1,2]]
df.iloc[1,2]

1.5398782535335265

In [18]:
df

                   A         B         C         D
2018-05-31 -1.635571  1.584917 -0.176443 -2.405092
2018-06-01  0.280497  0.035116  1.539878  0.887744
2018-06-02  0.133557  0.566037 -0.255709  1.003797
2018-06-03 -2.278084 -0.800635  0.811075 -0.527858
2018-06-04  0.700106 -0.818080 -0.554525 -0.931795
2018-06-05  1.251413  0.050459 -1.382395  0.126959

In [19]:
df[df.A > -0.3]

                   A         B         C         D
2018-06-01  0.280497  0.035116  1.539878  0.887744
2018-06-02  0.133557  0.566037 -0.255709  1.003797
2018-06-04  0.700106 -0.818080 -0.554525 -0.931795
2018-06-05  1.251413  0.050459 -1.382395  0.126959

In [20]:
df2=df.copy()
df2

                   A         B         C         D
2018-05-31 -1.635571  1.584917 -0.176443 -2.405092
2018-06-01  0.280497  0.035116  1.539878  0.887744
2018-06-02  0.133557  0.566037 -0.255709  1.003797
2018-06-03 -2.278084 -0.800635  0.811075 -0.527858
2018-06-04  0.700106 -0.818080 -0.554525 -0.931795
2018-06-05  1.251413  0.050459 -1.382395  0.126959

In [21]:
List=['one', 'one','two','three','four','three']
df2['E']=List
df2

                   A         B         C         D      E
2018-05-31 -1.635571  1.584917 -0.176443 -2.405092    one
2018-06-01  0.280497  0.035116  1.539878  0.887744    one
2018-06-02  0.133557  0.566037 -0.255709  1.003797    two
2018-06-03 -2.278084 -0.800635  0.811075 -0.527858  three
2018-06-04  0.700106 -0.818080 -0.554525 -0.931795   four
2018-06-05  1.251413  0.050459 -1.382395  0.126959  three

In [22]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
#df1
df1.loc[dates[1]:dates[2],'E'] = 3
df1

                   A         B         C         D    E
2018-05-31 -1.635571  1.584917 -0.176443 -2.405092  NaN
2018-06-01  0.280497  0.035116  1.539878  0.887744  3.0
2018-06-02  0.133557  0.566037 -0.255709  1.003797  3.0
2018-06-03 -2.278084 -0.800635  0.811075 -0.527858  NaN

In [23]:
df1.dropna(how='any')

                   A         B         C         D    E
2018-06-01  0.280497  0.035116  1.539878  0.887744  3.0
2018-06-02  0.133557  0.566037 -0.255709  1.003797  3.0

In [24]:
df1.fillna(value=5)

                   A         B         C         D    E
2018-05-31 -1.635571  1.584917 -0.176443 -2.405092  5.0
2018-06-01  0.280497  0.035116  1.539878  0.887744  3.0
2018-06-02  0.133557  0.566037 -0.255709  1.003797  3.0
2018-06-03 -2.278084 -0.800635  0.811075 -0.527858  5.0

In [25]:
pd.isna(df1)

                A      B      C      D      E
2018-05-31  False  False  False  False   True
2018-06-01  False  False  False  False  False
2018-06-02  False  False  False  False  False
2018-06-03  False  False  False  False   True

In [26]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2018-05-31    NaN
2018-06-01    NaN
2018-06-02    1.0
2018-06-03    3.0
2018-06-04    5.0
2018-06-05    NaN
Freq: D, dtype: float64

In [27]:
pd.isna(s)

2018-05-31     True
2018-06-01     True
2018-06-02    False
2018-06-03    False
2018-06-04    False
2018-06-05     True
Freq: D, dtype: bool

In [28]:
s.fillna(0)

2018-05-31    0.0
2018-06-01    0.0
2018-06-02    1.0
2018-06-03    3.0
2018-06-04    5.0
2018-06-05    0.0
Freq: D, dtype: float64

In [29]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
#ts
ts.plot()

# 命令使用？显示帮助文档

In [ ]:
t